Revit 2024 API
DividedPath.IsValidEndIndent Method
 Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidEndIndent(
	double endIndent
)
Visual Basic
Public Function IsValidEndIndent ( _
	endIndent As Double _
) As Boolean
Visual C++
public:
bool IsValidEndIndent(
	double endIndent
)
Parameters
endIndent
Type: System.Double
See Also
DividedPath Class
Autodesk.Revit.DB Namespace